In [1]:
import numpy as np
import math
import pandas as pd

### Context 
A common risk control method that banks and generally the financial industry use is credit score cards . Personal information and data are extracted by people's applications , to be used in prediction models for the likelyhood of future defaults and credit card borrowins , based on that the bank is able to make more accurate decisions on issuing credit cards to the applicants . 

So in the context of a course in Big Data , in AUEB Management Science and Technology we will use a dataset we extracted from Kaggle to build such predictive models . 

Iliadis Viktoras 
Giannis Vagionakis
Andreas Sofos

## ETL Process

We read the files the files we extracted from the [Credit Card Approval Prediction Kaggle Dataset](https://www.kaggle.com/rikdifos/credit-card-approval-prediction)  with the help of .read_csv from pandas . 
The data is only in csv format ,

### Extraction

In [13]:
ApplicationDF = pd.read_csv("Bank Data/application_record.csv")
CreditDF =  pd.read_csv("Bank Data/credit_record.csv")

Application Table Context and Explanation

In [14]:
ApplicationDF.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0